#+TITLE: CALLING FUNCTIONS - SCOPING
#+AUTHOR: Marcus Birkenkrahe
#+SUBTITLE: DSC 205 - Advanced introduction to data science
#+STARTUP: overview hideblocks indent
#+OPTIONS: toc:nil num:nil ^:nil
#+PROPERTY: header-args:python :session *Python* :results output :exports both :noweb yes

* Scoping in Python

- Scoping rules determine how Python stores and retrieves objects

- Python uses a LEGB rule: "Local, Enclosing, Global, Built-in"

- Example: Create a list and use it in a function
  #+begin_src python
    # create a list
    my_list = [1, 2, 3]

    # create a function
    def sum_list():
        '''Return sum of list values
        '''
        return sum(my_list)

    print(sum_list())
  #+end_src

  #+RESULTS:
  : 6

